[
  {
    "title": "What is GoLuxo?",
    "date": "2025-07-20",
    "category": "Journey",
    "description": "GoLuxo is a platform that showcases my journey as a developer and the projects I've worked on. I'm Samel, a 15-year-old developer from Newmarket, Ontario. I create luxury projects that match your desires. I hope you enjoy my work and find inspiration here. And make sure to get in touch with us if need anything, starting with websites, apps, and even games ! ",
    "image": "https://imgur.com/KJtvmRS.png"
  },
  {
    "title": "First background for GoLuxo",
    "date": "2025-07-21",
    "category": "Journey",
    "description": "Honestly, looks like a 5 year old made it, but it was my first attempt at a background.",
    "image": "https://i.imgur.com/bf7sFwy.jpeg"
  },
  {
    "title": "Why the name GoLuxo though?",
    "date": "2025-07-22",
    "category": "Journey",
    "description": "Our main goal is sort of to be luxurious, and to make things that are luxurious. So I thought, why not call it GoLuxo? It sounds cool, and it has a meaning behind it. It also has a nice ring to it, and I think it fits the brand well.",
    "image": "https://imgur.com/oJFAWYO.png"
  },
  {
    "title": "What is the best way to create websites?",
    "date": "2025-07-23",
    "category": "Education",
    "description": "Here's the thing about websites, depending on your goal, and your set of skills, your whole approach needs to be different. want to create a website that is simple as just introducing yourself? well the best way is to contact us first of all ! but if you are needed to make one of your own, Try to alway pick the easiest way to accomplish it. Trust me with these, nothing needs to be as hard as making a spaceship, You just need to find the language/framework that macthes your needs and gives you safety and a good nice look and you are very welcomed in coding cummunity. Sometimes there are different cases when someone wasnts to create and Social media app for example, it is very important to pick the safest and most modern language first of all and second you need to choose the best framework that will match your ideas and will give you enough speed and efficiency while having a nice look and goood user experience. The safety part about coding is that it 100% needs be checked several times before the final launche of your platform, make sure to talk with us if you need any help with that, we are always here to help you out. Good Luck!",
    "image": "https://imgur.com/1k0m2bH.png"
  }
]
